Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 32, 32, 64)        1792      
_________________________________________________________________
block1_BN1 (BatchNormalizati (None, 32, 32, 64)        256       
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 32, 32, 64)        36928     
_________________________________________________________________
block1_BN2 (BatchNormalizati (None, 32, 32, 64)        256       
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 16, 16, 64)        0         
_________________________________________________________________
block1_dropout (Dropout)     (None, 16, 16, 64)        0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 16, 16, 128)       73856     
_________________________________________________________________
block2_BN1 (BatchNormalizati (None, 16, 16, 128)       512       
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 16, 16, 128)       147584    
_________________________________________________________________
block2_BN2 (BatchNormalizati (None, 16, 16, 128)       512       
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 8, 8, 128)         0         
_________________________________________________________________
block2_dropout (Dropout)     (None, 8, 8, 128)         0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 8, 8, 256)         295168    
_________________________________________________________________
block3_BN1 (BatchNormalizati (None, 8, 8, 256)         1024      
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 8, 8, 256)         590080    
_________________________________________________________________
block3_BN2 (BatchNormalizati (None, 8, 8, 256)         1024      
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 8, 8, 256)         590080    
_________________________________________________________________
block3_BN3 (BatchNormalizati (None, 8, 8, 256)         1024      
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 8, 8, 256)         590080    
_________________________________________________________________
block4_BN1 (BatchNormalizati (None, 8, 8, 256)         1024      
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 8, 8, 256)         590080    
_________________________________________________________________
block4_BN2 (BatchNormalizati (None, 8, 8, 256)         1024      
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 8, 8, 256)         590080    
_________________________________________________________________
block4_BN3 (BatchNormalizati (None, 8, 8, 256)         1024      
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 8, 8, 128)         295040    
_________________________________________________________________
block5_BN1 (BatchNormalizati (None, 8, 8, 128)         512       
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 8, 8, 128)         147584    
_________________________________________________________________
block5_BN2 (BatchNormalizati (None, 8, 8, 128)         512       
_________________________________________________________________
block5_pool (UpSampling2D)   (None, 16, 16, 128)       0         
_________________________________________________________________
block6_conv1 (Conv2D)        (None, 16, 16, 64)        73792     
_________________________________________________________________
block6_BN1 (BatchNormalizati (None, 16, 16, 64)        256       
_________________________________________________________________
block6_conv2 (Conv2D)        (None, 16, 16, 64)        36928     
_________________________________________________________________
block6_BN2 (BatchNormalizati (None, 16, 16, 64)        256       
_________________________________________________________________
block6_pool (UpSampling2D)   (None, 32, 32, 64)        0         
_________________________________________________________________
block6_conv3 (Conv2D)        (None, 32, 32, 3)         1731      
=================================================================
Total params: 4,070,019
Trainable params: 4,065,411
Non-trainable params: 4,608
_________________________________________________________________